#include<iostream>
#include<cstdlib>
#include<cstream>
using namespace std;
int saldo();
int mercato();
int traders();
int prelievo();
int lavori();
int Shop();
int deposito();

int main()
{ cout<<"\n1)CREA ACCOUNT\n";
████████▄   ▄██████▄   ▄█        ▄█          ▄████████    ▄████████    ▄████████  ▄█  ████████▄     ▄████████ 
███   ▀███ ███    ███ ███       ███         ███    ███   ███    ███   ███    ███ ███  ███   ▀███   ███    ███ 
███    ███ ███    ███ ███       ███         ███    ███   ███    ███   ███    █▀  ███▌ ███    ███   ███    █▀  
███    ███ ███    ███ ███       ███         ███    ███  ▄███▄▄▄▄██▀   ███        ███▌ ███    ███  ▄███▄▄▄     
███    ███ ███    ███ ███       ███       ▀███████████ ▀▀███▀▀▀▀▀   ▀███████████ ███▌ ███    ███ ▀▀███▀▀▀     
███    ███ ███    ███ ███       ███         ███    ███ ▀███████████          ███ ███  ███    ███   ███    █▄  
███   ▄███ ███    ███ ███▌    ▄ ███▌    ▄   ███    ███   ███    ███    ▄█    ███ ███  ███   ▄███   ███    ███ 
████████▀   ▀██████▀  █████▄▄██ █████▄▄██   ███    █▀    ███    ███  ▄████████▀  █▀   ████████▀    ██████████ 
                      ▀         ▀                        ███    ███                                           
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
  return 0;
}
int saldo()
{
  //visualizzare il saldo,inserire un pop up che ti porta al programma mercato per aumentare oppure negozio(home)
  return 0;
  
}
