#include<iostream>
#include<cstdlib>
#include<cstream>
using namespace std;

int saldo();
int mercato();
int traders();
int prelievo();
int lavori();
int Shop();
int deposito();
string password;
string nu;

int main()
{cout<<"████████▄   ▄██████▄   ▄█        ▄█          ▄████████    ▄████████    ▄████████  ▄█  ████████▄     ▄████████ \n";
 cout<<"███   ▀███ ███    ███ ███       ███         ███    ███   ███    ███   ███    ███ ███  ███   ▀███   ███    ███ \n";
 cout<<"███    ███ ███    ███ ███       ███         ███    ███   ███    ███   ███    █▀  ███▌ ███    ███   ███    █▀  \n";
 cout<<"███    ███ ███    ███ ███       ███         ███    ███  ▄███▄▄▄▄██▀   ███        ███▌ ███    ███  ▄███▄▄▄     \n";
 cout<<"███    ███ ███    ███ ███       ███       ▀███████████ ▀▀███▀▀▀▀▀   ▀███████████ ███▌ ███    ███ ▀▀███▀▀▀     \n";
 cout<<"███    ███ ███    ███ ███       ███         ███    ███ ▀███████████          ███ ███  ███    ███   ███    █▄  \n";
 cout<<"███   ▄███ ███    ███ ███▌    ▄ ███▌    ▄   ███    ███   ███    ███    ▄█    ███ ███  ███   ▄███   ███    ███ \n";
 cout<<"████████▀   ▀██████▀  █████▄▄██ █████▄▄██   ███    █▀    ███    ███  ▄████████▀  █▀   ████████▀    ██████████ \n";
 cout<<"                     ▀         ▀                        ███    ███                                            ";
 cout<<"\nScrivi la Password (solo con lettere)\n";
 cin>>password;
 cout<<"\nScrivi nome utente (senza spazi)\n";
 cin>>nu;
 system("cls");
 cout<<"\nBenvenuti al menu,grazie di averci supportato...\n";
 cout<<"1) Saldo       ";
 cout<<"2) Mercato     ";
 cout<<"3) traders     ";
 cout<<"4) Prelievo    ";
 cout<<"5) Lavori      ";
 
 
 
 saldo();
 mercato();
 traders();
 prelievo();
 lavori();
 Shop();
 deposito();
     
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
                                                                                                              
  return 0;
}
int saldo()
{
  //visualizzare il saldo,inserire un pop up che ti porta al programma mercato per aumentare oppure negozio(home)
  return 0;
  
}
████████▄   ▄██████▄   ▄█        ▄█          ▄████████    ▄████████    ▄████████  ▄█  ████████▄     ▄████████ 
███   ▀███ ███    ███ ███       ███         ███    ███   ███    ███   ███    ███ ███  ███   ▀███   ███    ███ 
███    ███ ███    ███ ███       ███         ███    ███   ███    ███   ███    █▀  ███▌ ███    ███   ███    █▀  
███    ███ ███    ███ ███       ███         ███    ███  ▄███▄▄▄▄██▀   ███        ███▌ ███    ███  ▄███▄▄▄     
███    ███ ███    ███ ███       ███       ▀███████████ ▀▀███▀▀▀▀▀   ▀███████████ ███▌ ███    ███ ▀▀███▀▀▀     
███    ███ ███    ███ ███       ███         ███    ███ ▀███████████          ███ ███  ███    ███   ███    █▄  
███   ▄███ ███    ███ ███▌    ▄ ███▌    ▄   ███    ███   ███    ███    ▄█    ███ ███  ███   ▄███   ███    ███ 
████████▀   ▀██████▀  █████▄▄██ █████▄▄██   ███    █▀    ███    ███  ▄████████▀  █▀   ████████▀    ██████████ 
                      ▀         ▀                        ███    ███                                      
